# parameters
nc: 4  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P4/16
  - [30,61, 62,45, 59,119]  # P5/32
  - [116,90, 156,198, 373,326]  # P6/64

# EC-PFN backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2]],  # 0-P1/2
  
   [-1, 1, Conv, [64, 3, 2]],  # 1-P2/4
   [-1, 1, Conv, [64, 3, 2]],  # 2-P3/8

   [-1, 1, Conv, [32, 1, 1]],
   [-2, 1, Conv, [32, 1, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1]],  # 8

   [-1, 1, MP, []],  # 9-P4/16

   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],  # 15

   [-1, 1, MP, []],  # 16-P5/32

   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 22

   [-1, 1, MP, []],  # 23-P6/64

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 29

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, SP, [5]],
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  #38-P6
  ]

# EC-PFN head
head:
  [[-1, 1, BasicRFB, [256]],  #39
   [22, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #41-P4/16
   [[15, -1], 1, Concat, [1]],

   [-1, 1, UniFusionLayer, [128]],  # 43-P4/16

   [-1, 1, Conv, [128, 3, 2]],  #44-P5/32
   [38, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #46-P5/32
   [[40, -1, -3], 1, Concat, [1]],

   [-1, 1, UniFusionLayer, [256]],  #48-P5/32

   [-1, 1, Conv, [256, 3, 2]], #P6
   [[39, -1], 1, Concat, [1]],

   [-1, 1, UniFusionLayer, [256]], #51-P6

   [48, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #53-P4
   [[43, -1], 1, Concat, [1]],

   [-1, 1, UniFusionLayer, [128]], #55-P4

   [-1, 1, Conv, [128, 3, 2]], #56-P5
   [51, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],#58-P5
   [[48, -1, -3], 1, Concat, [1]],

   [-1, 1, UniFusionLayer, [256]],  #60-P5

   [-1, 1, Conv, [256, 3, 2]],#61-P6
   [[51, -1], 1, Concat, [1]],

   [-1, 1, UniFusionLayer, [512]], #63-P6

   [55, 1, Conv, [256, 3, 1]],
   [60, 1, Conv, [512, 3, 1]],
   [63, 1, Conv, [1024, 3, 1]],

   [[64,65,66], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
