# parameters
nc: 4  # number of classes
depth_multiple: 1.0  # model depth multiple
width_multiple: 1.0  # layer channel multiple

# anchors
anchors:
  - [10,13, 16,30, 33,23]  # P3/8
  - [30,61, 62,45, 59,119]  # P4/16
  - [116,90, 156,198, 373,326]  # P5/32

# yolov7-tiny backbone
backbone:
  # [from, number, module, args] c2, k=1, s=1, p=None, g=1, act=True
  [[-1, 1, Conv, [32, 3, 2]],  # 0-P1/2

   [-1, 1, Conv, [64, 3, 2]],  # 1-P2/4

   [-1, 1, Conv, [32, 1, 1]],
   [-2, 1, Conv, [32, 1, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [-1, 1, Conv, [32, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [64, 1, 1]],  # 7

   [-1, 1, MP, []],  # 8-P3/8

   [-1, 1, Conv, [64, 1, 1]],
   [-2, 1, Conv, [64, 1, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [-1, 1, Conv, [64, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [128, 1, 1]],  # 14

   [-1, 1, MP, []],  # 15-P4/16

   [-1, 1, Conv, [128, 1, 1]],
   [-2, 1, Conv, [128, 1, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [-1, 1, Conv, [128, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  # 21

   [-1, 1, MP, []],  # 22-P5/32

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [-1, 1, Conv, [256, 3, 1]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [512, 1, 1]],  # 28

   [-1, 1, Conv, [256, 1, 1]],
   [-2, 1, Conv, [256, 1, 1]],
   [-1, 1, SP, [5]],
   [-2, 1, SP, [9]],
   [-3, 1, SP, [13]],
   [[-1, -2, -3, -4], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],
   [[-1, -7], 1, Concat, [1]],
   [-1, 1, Conv, [256, 1, 1]],  #37-P5
  ]

# yolov7-tiny head
head:
  [[21, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #39-P3
   [[14, -1], 1, Concat, [1]],

   [-1, 1, CReToNeXt, [128]],  # 41-P3

   [-1, 1, Conv, [128, 3, 2]],  #42-P4
   [37, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #44-P4
   [[38, -1, -3], 1, Concat, [1]],

   [-1, 1, CReToNeXt, [256]],  #46-P4

   [-1, 1, Conv, [256, 3, 2]], #P5
   [[37, -1], 1, Concat, [1]],

   [-1, 1, CReToNeXt, [256]], #49-P5

   [46, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']], #51-P3
   [[41, -1], 1, Concat, [1]],

   [-1, 1, CReToNeXt, [128]], #53-P3

   [-1, 1, Conv, [128, 3, 2]], #54-P4
   [49, 1, Conv, [128, 1, 1]],
   [-1, 1, nn.Upsample, [None, 2, 'nearest']],#56-P4
   [[46, -1, -3], 1, Concat, [1]],

   [-1, 1, CReToNeXt, [256]],  #58-P4

   [-1, 1, Conv, [256, 3, 2]],#59-P5
   [[49, -1], 1, Concat, [1]],

   [-1, 1, CReToNeXt, [512]], #61-P5

   [53, 1, Conv, [256, 3, 1]],
   [58, 1, Conv, [512, 3, 1]],
   [61, 1, Conv, [1024, 3, 1]],

   [[62,63,64], 1, IDetect, [nc, anchors]],   # Detect(P3, P4, P5)
  ]
